// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = prompt('введіть число');
//  if (x > 0 || x < 0) {
//     console.log('Вірно');
//  } else {
//      console.log('невірно');
//
//  }
// //
//  let a =[ 1, 0, -3];
//
// x = a[0];
//  if (x > 0 || x < 0) {
//      console.log('Вірно');
//  } else {
//     console.log('невірно');
//  }
//  x = a[1];
//  if (x > 0 || x < 0) {
//      console.log('Вірно');
//  } else {
//      console.log('невірно');
//  }
//  x = a[-3]
//  if (a > 0 || x < 0) {
//     console.log('Вірно');
//  } else {
//      console.log('невірно');
//  }


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).



// let time = prompt('введіть число від 0 до 59');
// if (time > 0 && time <=15 ){
//     console.log('1 чверть');
// }
// else if (time > 15 && time <=30 ){
//     console.log('2 чверть');
// }
// else if (time > 30 && time <=45 ){
//     console.log('3 чверть');
// }
// else if (time > 45 && time <=59 ){
//     console.log('4 чверть');
// }else {
//     console.log('error');
// }
//
//
// let day = prompt('Введіть число від 1 до 31');
// if (day > 0 && day <= 10){
//     console.log('Перша декада');
// }
// else if (day > 10 && day <= 20){
//     console.log('Друга декада');
// }
// else if (day > 20 && day <= 31){
//     console.log('Третя декада');
// }else {
//     console.log('Введені дані неправильні');
// }






// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).


//  let schedule = prompt('enter dey');
//
//
// switch (schedule) {
//     case '1':
//
//         console.log('Sunday');
//       break;
//    case '2':
//      console.log('Monday');
//         break;
//     case '3':
//         console.log('Tuesday');
//         break;
//     case '4':
//         console.log('Wednesday');
//         break;
//     case '5':
//         console.log('Thursday');
//         break;
//     case '6':
//         console.log('Friday');
//         break;
//     case '7':
//         console.log('Saturday');
//         break;
// }





    // - Користувач вводить або має два числа.
    //     Потрібно знайти та вивести максимальне число з тих двох .
    //     Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('Введіть перше число');
// let b = +prompt('Введіть друге число');
// if (a > b){
//     console.log(a);
// } else if (b > a){
//     console.log(b)
// } else if (a === b){
//     console.log('Числа рівні між собою');
// } else {
//     console.log('error');
// }











// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)


let x = NaN || "default";
console.log(x);